app/controllers/users_controller.rb

  def sign_up!
    user = User.new
    if params[:password_confirmation] != params[:password]
      flash[:alert] = "Your passwords don't match!"
      render :sign_up
    elsif user.save_params(params).save!
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "robin"], ["password_digest", "thomas"], ["created_at", "2015-09-28 19:53:20.119579"], ["updated_at", "2015-09-28 19:53:20.119579"]]

  def sign_in!
    if current_user
      @user = current_user
    else
      @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "asdf"]]